const weatherMap = {
  '风': ['有风', '平静', '微风', '和风', '清风', '强风/劲风', '疾风', '大风', '烈风', '风暴', '狂爆风', '飓风', '热带风暴', '龙卷风'],
  '多云': ['少云', '晴间多云', '多云'],
  '雾': ['雾', '浓雾', '强浓雾', '轻雾', '大雾', '特强浓雾'],
  '浮尘': ['浮尘'],
  '沙尘暴': ['沙尘暴'],
  '强沙尘暴': ['强沙尘暴'],
  '扬沙': ['扬沙'],

  '晴': ['晴', '热'],

  '小雨': ['小雨', '毛毛雨/细雨', '小雨-中雨'],
  '中雨': ['中雨', '中雨-大雨', '阵雨', '雨'],
  '大雨': ['大雨-暴雨', '大雨', '强阵雨', '极端降雨'],
  '暴雨': ['暴雨-大暴雨', '暴雨'],
  '大暴雨': ['大暴雨-特大暴雨', '大暴雨'],
  '特大暴雨‘': ['特大暴雨'],
  '雷阵雨': ['强雷阵雨', '雷阵雨'],
  '雷阵雨伴有冰雹': ['雷阵雨伴有冰雹'],
  '冻雨': ['冻雨'],
  '雨夹雪': ['雨雪天气', '雨夹雪', '阵雨夹雪'],

  '冷': ['冷'],
  '雪': ['阵雪'],
  '小雪': ['雪', '小雪', '小雪-中雪'],
  '中雪': ['中雪', '中雪-大雪'],
  '大雪': ['大雪', '大雪-暴雪'],
  '暴雪': ['暴雪'],

  '阴': ['阴', '未知'],
  '霾': ['霾', '中度霾', '重度霾', '严重霾'],
};

export const getWeather = (detailedWeather: string) => {
  for (const [key, values] of Object.entries(weatherMap)) {
    if (values.includes(detailedWeather)) {
      return key;
    }
  }
  return '';
};
